huaiyanchen/STM_Feeder/bsp/stm32f10x/drivers/usart.c
    return 0;
}

rt_size_t uart_send_buf(rt_uint8_t comIndex, char *buf, rt_uint8_t len)
{
    if( comIndex == 2 ){
#ifdef RT_USING_UART2
		if(_uart.COMDev2 != RT_NULL){
			return _uart.COMDev2->write(_uart.COMDev2, 0x00, buf, len);
		}
#endif
    }else if( comIndex == 3 ){
#ifdef RT_USING_UART3
		if(_uart.COMDev3 != RT_NULL){
        	return _uart.COMDev3->write(_uart.COMDev3, 0x00, buf, len);
		}
#endif
    }else if( comIndex == 4 ){
#ifdef RT_USING_UART4
		if(_uart.COMDev4 != RT_NULL){
        	return _uart.COMDev4->write(_uart.COMDev4, 0x00, buf, len);
		}
#endif
    }else if( comIndex == 5 ){
#ifdef RT_USING_UART5
		if(_uart.COMDev5 != RT_NULL){
        	return _uart.COMDev5->write(_uart.COMDev5, 0x00, buf, len);
		}
#endif
    }else if( comIndex == 1 ){
#ifdef RT_USING_UART1
		if(_uart.COMDev1 != RT_NULL){
        	return _uart.COMDev1->write(_uart.COMDev1, 0x00, buf, len);
		}
#endif
    }

    return 0;
}

void ITS_UART_Init( ITS_UART *p )
{
#ifdef  RT_USING_UART2
    p->COMDev2 = rt_device_find("uart2");
    if(p->COMDev2 != RT_NULL){
        if (rt_device_open(p->COMDev2, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) != RT_EOK){ //RT_DEVICE_FLAG_STREAM
            rt_kprintf("finsh: can not open device: uart2\r\n");
        }       
    }
#endif
	
#ifdef  RT_USING_UART3
    p->COMDev3 = rt_device_find("uart3");
    if(p->COMDev3 != RT_NULL){
        if (rt_device_open(p->COMDev3, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) != RT_EOK){ //RT_DEVICE_FLAG_STREAM
            rt_kprintf("finsh: can not open device: uart3\r\n");
        }       
    }
#endif
    
 #ifdef  RT_USING_UART4
    p->COMDev4 = rt_device_find("uart4");
    if(p->COMDev4 != RT_NULL){
        if (rt_device_open(p->COMDev4, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) != RT_EOK){ //RT_DEVICE_FLAG_STREAM
            rt_kprintf("finsh: can not open device: uart4\r\n");
        }       
    }
#endif
    
#ifdef  RT_USING_UART5
    p->COMDev5 = rt_device_find("uart5");
    if(p->COMDev5 != RT_NULL){
        if (rt_device_open(p->COMDev5, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) != RT_EOK){ //RT_DEVICE_FLAG_STREAM
            rt_kprintf("finsh: can not open device: uart5\r\n");
        }       
    }
#endif  
    
#ifdef  RT_USING_UART1
    p->COMDev1 = rt_device_find("uart1");
    if(p->COMDev1 != RT_NULL){
        if (rt_device_open(p->COMDev1, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX) != RT_EOK){ //RT_DEVICE_FLAG_STREAM
            rt_kprintf("finsh: can not open device: uart1\r\n");
        }       
    }
#endif
}
